-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 04, 2018 at 04:12 PM
-- Server version: 10.1.30-MariaDB
-- PHP Version: 7.2.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ftps_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `study_place`
--

CREATE TABLE `study_place` (
  `id` int(11) NOT NULL,
  `place_name` varchar(245) DEFAULT NULL,
  `contact_name` varchar(145) DEFAULT NULL,
  `contact_position` varchar(45) DEFAULT NULL,
  `address` varchar(245) DEFAULT NULL,
  `district_id` int(11) DEFAULT NULL,
  `amphur_id` int(11) DEFAULT NULL,
  `province_id` int(11) DEFAULT NULL,
  `contact_phone` varchar(45) DEFAULT NULL,
  `contact_fax` varchar(45) DEFAULT NULL,
  `contact_email` varchar(45) DEFAULT NULL,
  `place_spec` text,
  `map_address` varchar(245) DEFAULT NULL,
  `lat` varchar(65) DEFAULT NULL,
  `long` varchar(65) DEFAULT NULL,
  `create_date` date DEFAULT NULL,
  `last_update` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `study_place`
--

INSERT INTO `study_place` (`id`, `place_name`, `contact_name`, `contact_position`, `address`, `district_id`, `amphur_id`, `province_id`, `contact_phone`, `contact_fax`, `contact_email`, `place_spec`, `map_address`, `lat`, `long`, `create_date`, `last_update`) VALUES
(4, 'สวนสละ นายนัน ชูเอียด', 'คุณนัน ชูเอียด ', 'เจ้าของกิจการ', '-', 8574, 961, 73, '087-8377042', '-', '-', '', 'ช่วยทุกขราษฎร์ ตำบล คูหาสวรรค์ อำเภอเมืองพัทลุง พัทลุง 93000 ประเทศไทย', '7.6166823', '100.07402309999998', NULL, NULL),
(5, 'ศูนย์พัฒนาที่ดินจังหวัดตรัง', 'คุณเสาวคนธ์ บุญยะวันตัง', 'นักวิชาการ', '-', 8390, 943, 72, '081-7480507', '-', '-', '', '98/1 ม.1 ตำบล บ้านควน อ.เมืองตรัง ตรัง 92000 ประเทศไทย', '7.5152', '99.64232919999995', NULL, NULL),
(6, 'วิสาหกิจชุมชน (กล้วยฉาบ)', 'ประทิ่น นาคมิตร  ', 'ประธานกลุ่ม', 'ม.3', 8589, 964, 73, '086-2921923, 074-605659', '-', '-', 'เหมาะสำหรับพานักศึกษาลงพื้นที่ดูงานด้านธุรกิจเกษตร เป็นกลุ่มวิสาหกิจชุมชนเข้มแข็ง', '122 หมู่ 3 ตำบล ลำสินธุ์ อำเภอ ศรีนครินทร์ พัทลุง 93000 ประเทศไทย', '7.5353135', '99.93826739999997', NULL, NULL),
(7, 'ฟาร์มเห็ดแหลมทองนาโหนด', 'คุณชัยยงค์ คชพันธ์', 'เจ้าของกิจการ', '-', 8515, 954, 73, '089-8702332', '-', '-', 'เหมาะสำหรับนักศึกษาดูงานด้านธุรกิจการเกษตร', '190 หมู่ที่11 ตำบล นาโหนด อำเภอเมืองพัทลุง พัทลุง 93000 ประเทศไทย', '7.4888451', '100.04349460000003', NULL, NULL),
(8, 'สถาบันการเงินชุมชน ตำบลกำแพงเพชร', 'คุณอิสมาแอ สามารถ ', 'ประธานกลุ่ม', '-', 8267, 926, 70, '084-8546015', '-', '-', 'เหมาะสำหรับดูงานองค์กรและสถาบันเกษตรกร', 'ถ. เพชรเกษม ตำบล กำแพงเพชร อำเภอ รัตภูมิ สงขลา 90180 ประเทศไทย', '7.019366', '100.2616899', NULL, NULL),
(9, 'กลุ่มเกษตรกรทำนาตะโหมด', 'คุณอรุณ ไพชำนาญ ', 'ประธานกลุ่ม', '-', 8538, 957, 73, '089-7372634', '-', '-', '', '', '7.3395832', '100.1131001', NULL, NULL),
(10, 'สหกรณ์เครดิตยูเนี่ยนบ้านควนพนางตุง จำกัด', 'คุณนิวัฒน์ บำรุงดี ', 'ประธานกลุ่ม', 'อ.ควนขนุน จ.พัทลุง', 8541, 958, 73, '089-7330551', '-', '-', NULL, 'สหกรณ์เครดิตยูเนี่ยนบ้านควนพนางตุง จำกัด', '0', '0', NULL, NULL),
(11, 'กลุ่มอาชีพสหกรณ์บ้านพังดาน', 'คุณชาย คงแก้ว  ', 'ประธานกลุ่ม', '-', 8541, 958, 73, '091-7767685', '-', '-', '', '', '0', '0', NULL, NULL),
(12, 'สวนป่าไผ่สร้างสุข', 'ธนาธีรภัทร์ (เทน) นวลแก้ว ', 'ประธานกลุ่ม', '-', 8541, 958, 73, '084-3960433', '-', '-', '', '4048 อำเภอ ควนขนุน พัทลุง 93110 ประเทศไทย', '7.72723295721826', '100.0068525240074', NULL, NULL),
(13, 'บ้านริมน้ำโฮมสเตย์ ตลาดน้ำคลองแดน', 'คุณกันภัย  พืชมงคล ', 'เจ้าของกิจการ', '-', 8248, 924, 70, '089-9756970', '-', '-', '', 'Unnamed Road, ตำบล ท่าบอน อำเภอ ระโนด สงขลา 90140 ประเทศไทย', '7.842152516149033', '100.33746805872192', NULL, NULL),
(14, 'ศูนย์เรียนรู้วิถีโหนด-นา-เล', 'คุณพูนทรัพย์ ศรีชู ', 'ประธานกลุ่ม', 'อ.สทิงพระ  จ.สงขลา', 8331, 932, 70, '081-2757156', '-', '-', NULL, 'ศูนย์เรียนรู้วิถีโหนด-นา-เล', '0', '0', NULL, NULL),
(15, 'ร้านสลัดบ้านนายบ๊วย', 'คุณสิรภพ ชูประเสริฐ ', 'เจ้าของกิจการ', 'อ.เมือง จ.พัทลุง', NULL, 954, 73, '081-5434007', '-', '-', NULL, 'สลัดบ้านนายบ๊วย', '0', '0', NULL, NULL),
(16, 'Greentech Biolab', 'คุณแอนโทรนี่ ไชยกุล ', 'เจ้าของกิจการ', '-', 8289, 928, 70, '081-9570929', '-', '-', '', '', '0', '0', NULL, NULL),
(17, 'กลุ่มส่งเสริมอาชีพสตรีเจ๊ะบิลัง (ขนมผูกรัก)', 'คุณมาซีเต๊าะ  บิลังโหนด', 'ประธานกลุ่ม', 'อ.เมือง จ.สตูล', 8354, 936, 71, '087-6305592', '-', '-', '', '', '0', '0', NULL, NULL),
(18, 'Lucky Super Bread', 'คุณศุภาพิชญ์ ดวงไข ', 'ประธานกลุ่ม', 'อ.เมือง จ.สตูล', NULL, 936, 71, '083-1834956', '-', '-', NULL, 'Lucky Super Bread', '0', '0', NULL, NULL),
(19, 'ศูนย์การเรียนรู้เศรษฐกิจพอเพียง ตามแนวทางพระราชดำริ กอ.รมน.จว.สตูล', 'คุณศิริพร  แก้วบุญ', 'ประธานกลุ่ม', 'อ.ควนกาหลง จ.สตูล  ', 8364, 938, 71, '087-3335556', '-', '-', NULL, 'ศูนย์การเรียนรู้เศรษฐกิจพอเพียง ตามแนวทางพระราชดำริ กอ.รมน.จว.สตูล', '0', '0', NULL, NULL),
(20, 'ศูนย์เรียนรู้เศรษฐกิจพอเพียงบ้านเขากลม', 'คุณสงวน มงคลศรีพันเลิศ', 'ประธานกลุ่ม', '-', 7801, 864, 64, '089-5906738', '-', '-', '', 'Unnamed Road, ตำบล หนองทะเล อำเภอเมืองกระบี่ กระบี่ 81000 ประเทศไทย', '8.106096491557613', '98.79809333527612', NULL, NULL),
(21, 'การทำประมงชายฝั่ง', 'คุณชวนคนึง วรัจฉรียกุล ', 'เกษตรตำบล', 'เกาะยาวน้อย', 7869, 873, 65, '087-8990337', '-', '-', NULL, 'จังหวัด พังงา   ', '0', '0', NULL, NULL),
(23, 'ณ โฮมสเตย์ เกาะยาวน้อย ', 'คุณสำเริง ราเขต ', 'ประธานกลุ่ม', '-', 7869, 873, 65, '081-9680877', '-', '-', NULL, 'ณ โฮมสเตย์ เกาะยาวน้อย   ', '0', '0', NULL, NULL),
(24, 'ศูนย์การเรียนรู้นาโปแก ', 'คุณปรียากร  สมบูรณ์แก้ว', 'ประธานกลุ่ม', 'อ.ควนขนุน จ.พัทลุง', 8541, 958, 73, '062-5916632', '-', '-', '', '4048 ตำบล มะกอกเหนือ อำเภอ ควนขนุน พัทลุง 93110 ประเทศไทย', '7.736021279864532', '100.04406638328624', NULL, NULL),
(25, 'โครงการ 1 ไร่ 1 แสน ', 'คุณณัฐพล หนูแสง  ', 'ประธานกลุ่ม', '-', 8252, 924, 70, '089-6530164', '-', '-', NULL, 'โครงการ 1 ไร่ 1 แสน   ', '0', '0', NULL, NULL),
(26, 'บ่อเตี้ยฟาร์ม', 'คุณสุนทร  นิยมยาตรา ', 'เจ้าของกิจการ', 'อ.สิงหนคร จ.สงขลา', 8341, 932, 70, '086-9641654', '-', '-', NULL, 'บ่อเตี้ยฟาร์ม', '0', '0', NULL, NULL),
(27, 'ศูนย์การเรียนรู้ ภูมิปัญญาชาวบก', 'คุณไพฑูรย์ (ครูฑูรย์) ศิริรักษ์ ', 'เจ้าของกิจการ', '-', 8197, 919, 70, '087-3912325', '-', '-', '', '408 ตำบล จะทิ้งพระ อำเภอ สทิงพระ สงขลา 90190 ประเทศไทย', '7.484866999999999', '100.437051', NULL, NULL),
(28, 'กลุ่มแม่บ้านหัวเขา', 'คุณอถิวรรนท์  ทองแท่น', 'เกษตรตำบล', '-', NULL, 936, 71, '081-5423608', '-', '-', NULL, 'กลุ่มแม่บ้านหัวเขา สตูล', '0', '0', NULL, NULL),
(29, 'กลุ่มกาแฟพื้นเมือง', 'คุณอถิวรรนท์  ทองแท่น  ', 'เกษตรตำบล', '-', NULL, 936, 71, '081-5423608', '-', '-', NULL, 'กลุ่มกาแฟพื้นเมือง จังหวัด สตูล   ', '0', '0', NULL, NULL),
(30, 'กลุ่มการทำโรตีกรอบ', 'คุณอถิวรรนท์  ทองแท่น  ', 'เกษตรตำบล', '-', NULL, 936, 71, '081-5423608', '-', '-', NULL, 'จังหวัด สตูล   ', '0', '0', NULL, NULL),
(31, 'สวนอินทนิน', 'คุณสายจิตร เจริญอาริยะ ', 'เจ้าของกิจการ', '-', NULL, 954, 73, '081-5426747', '--', '-', NULL, 'สวนอินทนิน', '0', '0', NULL, NULL),
(32, 'สวนครูนอง เศรษฐกิจพอเพียง', 'ครูบอล', 'ประธานกลุ่ม', '-', 8525, 956, 73, '087-2959524', '-', '-', NULL, 'สวนครูนอง เศรษฐกิจพอเพียง', '0', '0', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `study_place_major_list`
--

CREATE TABLE `study_place_major_list` (
  `id` int(11) NOT NULL,
  `study_place_id` int(11) DEFAULT NULL,
  `subject_major_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `study_place_major_list`
--

INSERT INTO `study_place_major_list` (`id`, `study_place_id`, `subject_major_id`) VALUES
(33, 11, 1),
(34, 11, 2),
(35, 24, 1),
(36, 24, 2),
(37, 24, 3),
(38, 27, 1),
(45, 17, 2),
(46, 13, 3),
(47, 20, 1),
(48, 20, 2),
(49, 16, 1),
(51, 5, 1),
(52, 5, 3),
(53, 4, 1),
(54, 4, 2),
(55, 4, 3),
(66, 6, 2),
(67, 6, 3),
(70, 8, 1),
(71, 8, 3),
(72, 7, 2),
(73, 9, 1),
(74, 9, 2),
(75, 9, 3);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `study_place`
--
ALTER TABLE `study_place`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `study_place_major_list`
--
ALTER TABLE `study_place_major_list`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `study_place`
--
ALTER TABLE `study_place`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `study_place_major_list`
--
ALTER TABLE `study_place_major_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
